{"title":{"0":"What's Mars Solar Conjunction, and Why Does It Matter?","1":"HiRISE Views NASA's InSight and Curiosity on Mars","2":"NASA Moves Forward With Campaign to Return Mars Samples to Earth","3":"NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight","4":"InSight's 'Mole' Team Peers into the Pit","5":"8 Martian Postcards to Celebrate Curiosity's Landing Anniversary","6":"NASA InSight's 'Mole' Is Out of Sight","7":"NASA's Mars 2020 Rover Tests Descent-Stage Separation","8":"Two Rovers to Roll on Mars Again: Curiosity and Mars 2020","9":"NASA Adds Return Sample Scientists to Mars 2020 Leadership Team","10":"NASA's Mars Reconnaissance Orbiter Undergoes Memory Update","11":"NASA's New Mars Rover Is Ready for Space Lasers","12":"7 Things to Know About the Mars 2020 Perseverance Rover Mission","13":"NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network","14":"How NASA's Mars Helicopter Will Reach the Red Planet's Surface"},"preview":{"0":"NASA spacecraft at Mars are going to be on their own for a few weeks when the Sun comes between Mars and Earth, interrupting communications.","1":"New images taken from space offer the clearest orbital glimpse yet of InSight as well as a view of Curiosity rolling along.","2":"During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships.","3":"Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check.","4":"Efforts to save the heat probe continue.","5":"The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance.","6":"Now that the heat probe is just below the Martian surface, InSight's arm will scoop some additional soil on top to help it keep digging so it can take Mars' temperature.","7":"A crane lifts the rocket-powered descent stage away from NASA's Mars 2020 rover after technicians tested the pyrotechnic charges that separate the two spacecraft.","8":"They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play.","9":"The leadership council for Mars 2020 science added two new members who represent the interests of scientists destined to handle and study the first samples from Red Planet.","10":"Other orbiters will continue relaying data from Mars surface missions for a two-week period.","11":"Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future.","12":"NASA's next rover to the Red Planet is slated to launch no earlier than July 30. These highlights will get you up to speed on the ambitious mission.","13":"Robotic spacecraft will be able to communicate with the dish using radio waves and lasers.","14":"The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}}